package org.aurorae.common.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum SpaceBall implements IBall {

    /**
     * 11       北京市          43       湖南省
     * 12       天津市          44       广东省
     * 13       河北省          45       广西壮族自治区
     * 14       山西省          46       海南省
     * 15       内蒙古自治区     50       重庆市
     * 21       辽宁省          51       四川省
     * 22       吉林省          52       贵州省
     * 23       黑龙江省        53       云南省
     * 31       上海市          54       西藏自治区
     * 32       江苏省          61       陕西省
     * 33       浙江省          62       甘肃省
     * 34       安徽省          63       青海省
     * 35       福建省          64       宁夏回族自治区
     * 36       江西省          65       新疆维吾尔自治区
     * 37       山东省          71       台湾省
     * 41       河南省          81       香港特别行政区
     * 42       湖北省          82       澳门特别行政区
     * 1、华北地区：北京市|11，天津市|12，河北省|13，山西省|14，内蒙古自治区|15；
     * 2、东北地区：辽宁省|21，吉林省|22，黑龙江省|23；
     * 3、华东地区：上海市|31，江苏省|32，浙江省|33，安徽省|34，福建省|35，江西省|36，山东省|37；
     * 4、华中地区：河南省|41，湖北省|42，湖南省|43；
     * 5、华南地区：广东省|44，广西壮族自治区|45，海南省|46；
     * 6、西南地区：四川省|51，贵州省|52，云南省|53，西藏自治区|54，重庆市|50；
     * 7、西北地区：陕西省|61，甘肃省|62，青海省|63，宁夏回族自治区|64，新疆维吾尔自治区|65；
     * 8、特别地区：台湾地区(886)|83，香港特别行政区（852)|81，澳门特别行政区（853)|82。
     * 台京津冀晋蒙辽吉黑沪苏浙皖闽赣鲁豫鄂湘粤桂琼渝川黔滇藏陕甘青宁新港澳
     * 京津冀、黑吉辽、江浙沪、鲁豫、云贵川渝、湘鄂、陕甘宁、港澳台
     */
    J01("01", "北京", "京"),
    J02("02", "天津", "津"),
    J03("03", "河北", "冀"),
    J04("04", "山西", "晋"),
    M05("05", "内蒙", "蒙"),
    L06("06", "辽宁", "辽"),
    J07("07", "吉林", "吉"),
    H08("08", "龙江", "黑"),
    H09("09", "上海", "沪"),
    S10("10", "江苏", "苏"),
    Z11("11", "浙江", "浙"),
    W12("12", "安徽", "皖"),
    M13("13", "福建", "闽"),
    G14("14", "江西", "赣"),
    L15("15", "山东", "鲁"),
    Y16("16", "河南", "豫"),
    E17("17", "湖北", "鄂"),
    X18("18", "湖南", "湘"),
    Y19("19", "广东", "粤"),
    G20("20", "广西", "桂"),
    Q21("21", "海南", "琼"),
    Y22("22", "重庆", "渝"),
    C23("23", "四川", "川"),
    Q24("24", "贵州", "黔"),
    D25("25", "云南", "滇"),
    Z26("26", "西藏", "藏"),
    S27("27", "陕西", "陕"),
    G28("28", "甘肃", "甘"),
    Q29("29", "青海", "青"),
    N30("30", "宁夏", "宁"),
    X31("31", "新疆", "新"),
    G32("32", "香港", "港"),
    A33("33", "澳门", "澳");

    private final String id;
    private final String name;
    private final String label;
}
